package exam5;

public class JavaFinalTest {

	public static void main(String[] args) {
		
		// 알고리즘 순서는 알지만 자바 메서드나 선언방식을 제대로 익히지 못해 알고리즘이라도 남깁니다.
		
		// 1. "아래 메뉴를 입력하세요", "1. 단어 입력", "2. 단어 검색", "3. 단어 파일로 저장". "4. 종료" 를 줄바꿈을 포함하여 출력
		
		// 2. 1 입력 시, scanner를 통해 원하는 단어와 뜻을 입력 <- string 변수 str1과 str2를 만들어 사용. 입력받은 후 해쉬 맵에 할당.
		// -> 해당 기능을 InputHashMap(string _str1, string _str2)의 함수로 만들면 편리함.
		
		// 3. 2 입력 시, 단어로 검색할 수 있음. 맵은 key값과 value값을 가지지만, key값으로만 검색할 수 있기에, 영단어로만 검색 가능.
		
		// 4. 3 입력 시, dictionary를 통해 단어 파일로 저장.
		
		// 5. 4 입력 시, 종료. (반복문 끝남.)
		
		
		// 죄송합니다. 전날 밤새 프로젝트 준비에 치여 공부하지 못했습니다.
	}

}
